Architecture Updated
